In [16]:
import pandas as pd
pd.set_option('display.max_column',10)
df=pd.read_excel("marksheet EEE.xlsx")
print(df)

   Unnamed: 0.1  Unnamed: 0  S.no  Roll number     Name   Eng  Tamil  Science  \
0             0           0     1           10      Bala   80     65       69
1             1           1     2           11    Balaji   98     53       92
2             2           2     3           12    Barath   98     99       94
3             3           3     4           13   Bharath   84     99       94
4             4           4     5           14    Bhavan   84     99       94
5             5           5     6           15    Bhavya   90     61       70
6             6           6     7           16   Chandra   90     56       99
7             7           7     8           17  Chelliah   66     56       99
8             8           8     9           18   Deepika   91     67       94
9             9           9    10           19     Diana   83     67       94

   Social  Total
0      55    358
1      76    374
2      76    374
3      64    374
4      64    374
5      83    374
6      83    374
7      62    374
8      62    374
9      55    374

In [9]:
k=df.fillna(method='pad')
print(k)

   Unnamed: 0  ...  Total
0           0  ...  358.0
1           1  ...  374.0
2           2  ...  374.0
3           3  ...  374.0
4           4  ...  374.0
5           5  ...  374.0
6           6  ...  374.0
7           7  ...  374.0
8           8  ...  374.0
9           9  ...  374.0

[10 rows x 10 columns]

In [8]:
print("\n updated line\n")
k.to_excel("marksheet EEE.xlsx")

 updated line

In [17]:
k.drop(['Science'],axis=1,inplace=True)
print(k)
k.to_excel("marksheet EEE.xlsx")

   Unnamed: 0  S.no  Roll number     Name    Eng  Tamil  Social  Total
0           0     1           10      Bala  80.0   65.0    55.0  358.0
1           1     2           11    Balaji  98.0   53.0    76.0  374.0
2           2     3           12    Barath  98.0   99.0    76.0  374.0
3           3     4           13   Bharath  84.0   99.0    64.0  374.0
4           4     5           14    Bhavan  84.0   99.0    64.0  374.0
5           5     6           15    Bhavya  90.0   61.0    83.0  374.0
6           6     7           16   Chandra  90.0   56.0    83.0  374.0
7           7     8           17  Chelliah  66.0   56.0    62.0  374.0
8           8     9           18   Deepika  91.0   67.0    62.0  374.0
9           9    10           19     Diana  83.0   67.0    55.0  374.0

In [20]:
print("\n Drop NaN row:\n")
df=pd.read_excel("marksheet EEE1.xlsx")
print(df)
x=df.dropna()
print(x)
x.to_excel("marksheet EEE1.xlsx")

 Drop NaN row:

   Unnamed: 0  S.no  Roll number     Name    Eng  Tamil  Maths  Science  \
0           0     1           10      Bala  80.0   65.0   89.0     69.0
1           1     2           11    Balaji  98.0   53.0   55.0     92.0
2           2     3           12    Barath   NaN   99.0    NaN     94.0
3           3     4           13   Bharath  84.0    NaN   89.0      NaN
4           4     5           14    Bhavan   NaN    NaN    NaN      NaN
5           5     6           15    Bhavya  90.0   61.0   56.0     70.0
6           6     7           16   Chandra   NaN   56.0    NaN     99.0
7           7     8           17  Chelliah  66.0    NaN   77.0      NaN
8           8     9           18   Deepika  91.0   67.0    NaN     94.0
9           9    10           19     Diana  83.0    NaN   59.0      NaN

   Social  Total
0    55.0  358.0
1    76.0  374.0
2     NaN    NaN
3    64.0    NaN
4     NaN    NaN
5    83.0    NaN
6     NaN    NaN
7    62.0    NaN
8     NaN    NaN
9    55.0    NaN
   Unnamed: 0  S.no  Roll number   Name    Eng  Tamil  Maths  Science  Social  \
0           0     1           10    Bala  80.0   65.0   89.0     69.0    55.0
1           1     2           11  Balaji  98.0   53.0   55.0     92.0    76.0

   Total
0  358.0
1  374.0

In [21]:
print("\n Replace values:\n")
n=pd.read_excel("marksheet EEE.xlsx")
print(n)
y=n.replace({76:100})
print(y)
y.to_excel("marksheet EEE.xlsx")

 Replace values:

   Unnamed: 0.1  Unnamed: 0  S.no  Roll number     Name   Eng  Tamil  Social  \
0             0           0     1           10      Bala   80     65      55
1             1           1     2           11    Balaji   98     53      76
2             2           2     3           12    Barath   98     99      76
3             3           3     4           13   Bharath   84     99      64
4             4           4     5           14    Bhavan   84     99      64
5             5           5     6           15    Bhavya   90     61      83
6             6           6     7           16   Chandra   90     56      83
7             7           7     8           17  Chelliah   66     56      62
8             8           8     9           18   Deepika   91     67      62
9             9           9    10           19     Diana   83     67      55

   Total
0    358
1    374
2    374
3    374
4    374
5    374
6    374
7    374
8    374
9    374
   Unnamed: 0.1  Unnamed: 0  S.no  Roll number     Name   Eng  Tamil  Social  \
0             0           0     1           10      Bala   80     65      55
1             1           1     2           11    Balaji   98     53     100
2             2           2     3           12    Barath   98     99     100
3             3           3     4           13   Bharath   84     99      64
4             4           4     5           14    Bhavan   84     99      64
5             5           5     6           15    Bhavya   90     61      83
6             6           6     7           16   Chandra   90     56      83
7             7           7     8           17  Chelliah   66     56      62
8             8           8     9           18   Deepika   91     67      62
9             9           9    10           19     Diana   83     67      55

   Total
0    358
1    374
2    374
3    374
4    374
5    374
6    374
7    374
8    374
9    374

In [24]:
df=pd.read_excel("marksheet EEE.xlsx")
print(df)
print("\n Extract using isin() function:\n")
new=df['Social'].isin([100])
print(df[new])

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  S.no  Roll number     Name   Eng  \
0             0             0           0     1           10      Bala   80
1             1             1           1     2           11    Balaji   98
2             2             2           2     3           12    Barath   98
3             3             3           3     4           13   Bharath   84
4             4             4           4     5           14    Bhavan   84
5             5             5           5     6           15    Bhavya   90
6             6             6           6     7           16   Chandra   90
7             7             7           7     8           17  Chelliah   66
8             8             8           8     9           18   Deepika   91
9             9             9           9    10           19     Diana   83

   Tamil  Social  Total
0     65      55    358
1     53     100    374
2     99     100    374
3     99      64    374
4     99      64    374
5     61      83    374
6     56      83    374
7     56      62    374
8     67      62    374
9     67      55    374

 Extract using isin() function:

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  S.no  Roll number   Name   Eng  \
1             1             1           1     2           11  Balaji   98
2             2             2           2     3           12  Barath   98

   Tamil  Social  Total
1     53     100    374
2     99     100    374